using Newtonsoft.Json;
using TShockAPI;

namespace 幸运方块
{
    public class 幸运方块配置表
    {
        public static void GetConfig()
        {
            try
            {
                var config = new 幸运方块配置表();
                if (!File.Exists(path))
                {
                    if (!File.Exists(Path.Combine(TShock.SavePath, "幸运方块配置表.json"))) FileTools.CreateIfNot(Path.Combine(TShock.SavePath, "幸运方块配置表.json"), JsonConvert.SerializeObject(幸运方块.配置, Formatting.Indented));
                    幸运方块.配置 = JsonConvert.DeserializeObject<幸运方块配置表>(File.ReadAllText(Path.Combine(TShock.SavePath, "幸运方块配置表.json")));
                    幸运方块.配置.幸运方块内部图格ID.Add(45);
                    幸运方块.配置.幸运方块内部图格ID.Add(169);
                    幸运方块.配置.幸运方块掉落物品ID.Add(1);
                    幸运方块.配置.幸运方块掉落物品ID.Add(2);
                    幸运方块.配置.幸运方块掉落物品ID.Add(3);
                    幸运方块.配置.幸运方块掉落物品ID.Add(4);
                    幸运方块.配置.幸运方块掉落物品ID.Add(5);
                    幸运方块.配置.幸运方块掉落物品ID.Add(6);
                    幸运方块.配置.幸运方块掉落物品ID.Add(7);
                    幸运方块.配置.幸运方块掉落物品ID.Add(8);
                    幸运方块.配置.幸运方块掉落物品ID.Add(9);
                    幸运方块.配置.幸运方块掉落物品ID.Add(10);
                    幸运方块.配置.幸运方块掉落物品ID.Add(11);
                    幸运方块.配置.幸运方块掉落物品ID.Add(12);
                    幸运方块.配置.幸运方块掉落物品ID.Add(13);
                    幸运方块.配置.幸运方块掉落物品ID.Add(14);
                    幸运方块.配置.幸运方块掉落物品ID.Add(15);
                    幸运方块.配置.幸运方块掉落物品ID.Add(16);
                    幸运方块.配置.幸运方块掉落物品ID.Add(17);
                    幸运方块.配置.幸运方块掉落物品ID.Add(18);
                    幸运方块.配置.幸运方块掉落物品ID.Add(19);
                    幸运方块.配置.幸运方块掉落物品ID.Add(28);
                    幸运方块.配置.幸运方块掉落物品ID.Add(29);
                    幸运方块.配置.幸运方块掉落物品ID.Add(31);
                    幸运方块.配置.幸运方块掉落物品ID.Add(32);
                    幸运方块.配置.幸运方块掉落物品ID.Add(33);
                    幸运方块.配置.幸运方块掉落物品ID.Add(35);
                    幸运方块.配置.幸运方块掉落物品ID.Add(36);
                    幸运方块.配置.幸运方块掉落物品ID.Add(39);
                    幸运方块.配置.幸运方块掉落物品ID.Add(41);
                    幸运方块.配置.幸运方块掉落物品ID.Add(43);
                    幸运方块.配置.幸运方块掉落物品ID.Add(44);
                    幸运方块.配置.幸运方块掉落物品ID.Add(49);
                    幸运方块.配置.幸运方块掉落物品ID.Add(50);
                    幸运方块.配置.幸运方块掉落物品ID.Add(52);
                    幸运方块.配置.幸运方块掉落物品ID.Add(53);
                    幸运方块.配置.幸运方块掉落物品ID.Add(54);
                    幸运方块.配置.幸运方块掉落物品ID.Add(55);
                    幸运方块.配置.幸运方块掉落物品ID.Add(63);
                    幸运方块.配置.幸运方块掉落物品ID.Add(64);
                    幸运方块.配置.幸运方块掉落物品ID.Add(65);
                    幸运方块.配置.幸运方块掉落物品ID.Add(70);
                    幸运方块.配置.幸运方块掉落物品ID.Add(71);
                    幸运方块.配置.幸运方块掉落物品ID.Add(72);
                    幸运方块.配置.幸运方块掉落物品ID.Add(73);
                    幸运方块.配置.幸运方块掉落物品ID.Add(74);
                    幸运方块.配置.幸运方块掉落物品ID.Add(79);
                    幸运方块.配置.幸运方块掉落物品ID.Add(83);
                    幸运方块.配置.幸运方块掉落物品ID.Add(82);
                    幸运方块.配置.幸运方块掉落物品ID.Add(84);
                    幸运方块.配置.幸运方块掉落物品ID.Add(87);
                    幸运方块.配置.幸运方块掉落物品ID.Add(88);
                    幸运方块.配置.幸运方块掉落物品ID.Add(92);
                    幸运方块.配置.幸运方块掉落物品ID.Add(95);
                    幸运方块.配置.幸运方块掉落物品ID.Add(96);
                    幸运方块.配置.幸运方块掉落物品ID.Add(97);
                    幸运方块.配置.幸运方块掉落物品ID.Add(98);
                    幸运方块.配置.幸运方块掉落物品ID.Add(100);
                    幸运方块.配置.幸运方块掉落物品ID.Add(101);
                    幸运方块.配置.幸运方块掉落物品ID.Add(102);
                    幸运方块.配置.幸运方块掉落物品ID.Add(103);
                    幸运方块.配置.幸运方块掉落物品ID.Add(104);
                    幸运方块.配置.幸运方块掉落物品ID.Add(105);
                    幸运方块.配置.幸运方块掉落物品ID.Add(106);
                    幸运方块.配置.幸运方块掉落物品ID.Add(107);
                    幸运方块.配置.幸运方块掉落物品ID.Add(108);
                    幸运方块.配置.幸运方块掉落物品ID.Add(109);
                    幸运方块.配置.幸运方块掉落物品ID.Add(110);
                    幸运方块.配置.幸运方块掉落物品ID.Add(111);
                    幸运方块.配置.幸运方块掉落物品ID.Add(112);
                    幸运方块.配置.幸运方块掉落物品ID.Add(113);
                    幸运方块.配置.幸运方块掉落物品ID.Add(114);
                    幸运方块.配置.幸运方块掉落物品ID.Add(115);
                    幸运方块.配置.幸运方块掉落物品ID.Add(118);
                    幸运方块.配置.幸运方块掉落物品ID.Add(119);
                    幸运方块.配置.幸运方块掉落物品ID.Add(120);
                    幸运方块.配置.幸运方块掉落物品ID.Add(121);
                    幸运方块.配置.幸运方块掉落物品ID.Add(122);
                    幸运方块.配置.幸运方块掉落物品ID.Add(127);
                    幸运方块.配置.幸运方块掉落物品ID.Add(128);
                    幸运方块.配置.幸运方块掉落物品ID.Add(134);
                    幸运方块.配置.幸运方块掉落物品ID.Add(141);
                    幸运方块.配置.幸运方块掉落物品ID.Add(148);
                    幸运方块.配置.幸运方块掉落物品ID.Add(155);
                    幸运方块.配置.幸运方块掉落物品ID.Add(156);
                    幸运方块.配置.幸运方块掉落物品ID.Add(157);
                    幸运方块.配置.幸运方块掉落物品ID.Add(158);
                    幸运方块.配置.幸运方块掉落物品ID.Add(159);
                    幸运方块.配置.幸运方块掉落物品ID.Add(160);
                    幸运方块.配置.幸运方块掉落物品ID.Add(162);
                    幸运方块.配置.幸运方块掉落物品ID.Add(163);
                    幸运方块.配置.幸运方块掉落物品ID.Add(164);
                    幸运方块.配置.幸运方块掉落物品ID.Add(166);
                    幸运方块.配置.幸运方块掉落物品ID.Add(169);
                    幸运方块.配置.幸运方块掉落物品ID.Add(170);
                    幸运方块.配置.幸运方块掉落物品ID.Add(171);
                    幸运方块.配置.幸运方块掉落物品ID.Add(172);
                    幸运方块.配置.幸运方块掉落物品ID.Add(173);
                    幸运方块.配置.幸运方块掉落物品ID.Add(174);
                    幸运方块.配置.幸运方块掉落物品ID.Add(182);
                    幸运方块.配置.幸运方块掉落物品ID.Add(183);
                    幸运方块.配置.幸运方块掉落物品ID.Add(188);
                    幸运方块.配置.幸运方块掉落物品ID.Add(189);
                    幸运方块.配置.幸运方块掉落物品ID.Add(192);
                    幸运方块.配置.幸运方块掉落物品ID.Add(195);
                    幸运方块.配置.幸运方块掉落物品ID.Add(203);
                    幸运方块.配置.幸运方块掉落物品ID.Add(205);
                    幸运方块.配置.幸运方块掉落物品ID.Add(206);
                    幸运方块.配置.幸运方块掉落物品ID.Add(208);
                    幸运方块.配置.幸运方块掉落物品ID.Add(209);
                    幸运方块.配置.幸运方块掉落物品ID.Add(211);
                    幸运方块.配置.幸运方块掉落物品ID.Add(212);
                    幸运方块.配置.幸运方块掉落物品ID.Add(215);
                    幸运方块.配置.幸运方块掉落物品ID.Add(216);
                    幸运方块.配置.幸运方块掉落物品ID.Add(221);
                    幸运方块.配置.幸运方块掉落物品ID.Add(222);
                    幸运方块.配置.幸运方块掉落物品ID.Add(223);
                    幸运方块.配置.幸运方块掉落物品ID.Add(224);
                    幸运方块.配置.幸运方块掉落物品ID.Add(225);
                    幸运方块.配置.幸运方块掉落物品ID.Add(227);
                    幸运方块.配置.幸运方块掉落物品ID.Add(235);
                    幸运方块.配置.幸运方块掉落物品ID.Add(238);
                    幸运方块.配置.幸运方块掉落物品ID.Add(239);
                    幸运方块.配置.幸运方块掉落物品ID.Add(242);
                    幸运方块.配置.幸运方块掉落物品ID.Add(243);
                    幸运方块.配置.幸运方块掉落物品ID.Add(246);
                    幸运方块.配置.幸运方块掉落物品ID.Add(247);
                    幸运方块.配置.幸运方块掉落物品ID.Add(248);
                    幸运方块.配置.幸运方块掉落物品ID.Add(249);
                    幸运方块.配置.幸运方块掉落物品ID.Add(250);
                    幸运方块.配置.幸运方块掉落物品ID.Add(251);
                    幸运方块.配置.幸运方块掉落物品ID.Add(254);
                    幸运方块.配置.幸运方块掉落物品ID.Add(255);
                    幸运方块.配置.幸运方块掉落物品ID.Add(259);
                    幸运方块.配置.幸运方块掉落物品ID.Add(260);
                    幸运方块.配置.幸运方块掉落物品ID.Add(264);
                    幸运方块.配置.幸运方块掉落物品ID.Add(266);
                    幸运方块.配置.幸运方块掉落物品ID.Add(267);
                    幸运方块.配置.幸运方块掉落物品ID.Add(268);
                    幸运方块.配置.幸运方块掉落物品ID.Add(269);
                    幸运方块.配置.幸运方块掉落物品ID.Add(270);
                    幸运方块.配置.幸运方块掉落物品ID.Add(272);
                    幸运方块.配置.幸运方块掉落物品ID.Add(275);
                    幸运方块.配置.幸运方块掉落物品ID.Add(276);
                    幸运方块.配置.幸运方块掉落物品ID.Add(277);
                    幸运方块.配置.幸运方块掉落物品ID.Add(280);
                    幸运方块.配置.幸运方块掉落物品ID.Add(284);
                    幸运方块.配置.幸运方块掉落物品ID.Add(286);
                    幸运方块.配置.幸运方块掉落物品ID.Add(292);
                    幸运方块.配置.幸运方块掉落物品ID.Add(295);
                    幸运方块.配置.幸运方块掉落物品ID.Add(296);
                    幸运方块.配置.幸运方块掉落物品ID.Add(298);
                    幸运方块.配置.幸运方块掉落物品ID.Add(300);
                    幸运方块.配置.幸运方块掉落物品ID.Add(305);
                    幸运方块.配置.幸运方块掉落物品ID.Add(306);
                    幸运方块.配置.幸运方块掉落物品ID.Add(307);
                    幸运方块.配置.幸运方块掉落物品ID.Add(308);
                    幸运方块.配置.幸运方块掉落物品ID.Add(309);
                    幸运方块.配置.幸运方块掉落物品ID.Add(310);
                    幸运方块.配置.幸运方块掉落物品ID.Add(313);
                    幸运方块.配置.幸运方块掉落物品ID.Add(314);
                    幸运方块.配置.幸运方块掉落物品ID.Add(315);
                    幸运方块.配置.幸运方块掉落物品ID.Add(316);
                    幸运方块.配置.幸运方块掉落物品ID.Add(317);
                    幸运方块.配置.幸运方块掉落物品ID.Add(318);
                    幸运方块.配置.幸运方块掉落物品ID.Add(321);
                    幸运方块.配置.幸运方块掉落物品ID.Add(323);
                    幸运方块.配置.幸运方块掉落物品ID.Add(324);
                    幸运方块.配置.幸运方块掉落物品ID.Add(332);
                    幸运方块.配置.幸运方块掉落物品ID.Add(362);
                    幸运方块.配置.幸运方块掉落物品ID.Add(363);
                    幸运方块.配置.幸运方块掉落物品ID.Add(364);
                    幸运方块.配置.幸运方块掉落物品ID.Add(365);
                    幸运方块.配置.幸运方块掉落物品ID.Add(369);
                    幸运方块.配置.幸运方块掉落物品ID.Add(370);
                    幸运方块.配置.幸运方块掉落物品ID.Add(394);
                    幸运方块.配置.幸运方块掉落物品ID.Add(398);
                    幸运方块.配置.幸运方块掉落物品ID.Add(408);
                    幸运方块.配置.幸运方块掉落物品ID.Add(412);
                    幸运方块.配置.幸运方块掉落物品ID.Add(421);
                    幸运方块.配置.幸运方块掉落物品ID.Add(424);
                    幸运方块.配置.幸运方块掉落物品ID.Add(425);
                    幸运方块.配置.幸运方块掉落物品ID.Add(434);
                    幸运方块.配置.幸运方块掉落物品ID.Add(438);
                    幸运方块.配置.幸运方块掉落物品ID.Add(439);
                    幸运方块.配置.幸运方块掉落物品ID.Add(440);
                    幸运方块.配置.幸运方块掉落物品ID.Add(441);
                    幸运方块.配置.幸运方块掉落物品ID.Add(442);
                    幸运方块.配置.幸运方块掉落物品ID.Add(443);
                    幸运方块.配置.幸运方块掉落物品ID.Add(444);
                    幸运方块.配置.幸运方块掉落物品ID.Add(445);
                    幸运方块.配置.幸运方块掉落物品ID.Add(446);
                    幸运方块.配置.幸运方块掉落物品ID.Add(453);
                    幸运方块.配置.幸运方块掉落物品ID.Add(454);
                    幸运方块.配置.幸运方块掉落物品ID.Add(461);
                    幸运方块.配置.幸运方块掉落物品ID.Add(462);
                    幸运方块.配置.幸运方块掉落物品ID.Add(464);
                    幸运方块.配置.幸运方块掉落物品ID.Add(468);
                    幸运方块.配置.幸运方块掉落物品ID.Add(470);
                    幸运方块.配置.幸运方块掉落物品ID.Add(471);
                    幸运方块.配置.幸运方块掉落物品ID.Add(472);
                    幸运方块.配置.幸运方块掉落物品ID.Add(473);
                    幸运方块.配置.幸运方块掉落物品ID.Add(473);
                    幸运方块.配置.幸运方块掉落物品ID.Add(474);
                    幸运方块.配置.幸运方块掉落物品ID.Add(475);
                    幸运方块.配置.幸运方块掉落物品ID.Add(479);
                    幸运方块.配置.幸运方块掉落物品ID.Add(480);
                    幸运方块.配置.幸运方块掉落物品ID.Add(488);
                    幸运方块.配置.幸运方块掉落物品ID.Add(497);
                    幸运方块.配置.幸运方块掉落物品ID.Add(495);
                    幸运方块.配置.幸运方块掉落物品ID.Add(498);
                    幸运方块.配置.幸运方块掉落物品ID.Add(501);
                    幸运方块.配置.幸运方块掉落物品ID.Add(502);
                    幸运方块.配置.幸运方块掉落物品ID.Add(503);
                    幸运方块.配置.幸运方块掉落物品ID.Add(507);
                    幸运方块.配置.幸运方块掉落物品ID.Add(513);
                    幸运方块.配置.幸运方块掉落物品ID.Add(521);
                    幸运方块.配置.幸运方块掉落物品ID.Add(522);
                    幸运方块.配置.幸运方块掉落物品ID.Add(526);
                    幸运方块.配置.幸运方块掉落物品ID.Add(529);
                    幸运方块.配置.幸运方块掉落物品ID.Add(538);
                    幸运方块.配置.幸运方块掉落物品ID.Add(539);
                    幸运方块.配置.幸运方块掉落物品ID.Add(540);
                    幸运方块.配置.幸运方块掉落物品ID.Add(550);
                    幸运方块.配置.幸运方块掉落物品ID.Add(555);
                    幸运方块.配置.幸运方块掉落物品ID.Add(562);
                    幸运方块.配置.幸运方块掉落物品ID.Add(563);
                    幸运方块.配置.幸运方块掉落物品ID.Add(564);
                    幸运方块.配置.幸运方块掉落物品ID.Add(565);
                    幸运方块.配置.幸运方块掉落物品ID.Add(566);
                    幸运方块.配置.幸运方块掉落物品ID.Add(567);
                    幸运方块.配置.幸运方块掉落物品ID.Add(568);
                    幸运方块.配置.幸运方块掉落物品ID.Add(569);
                    幸运方块.配置.幸运方块掉落物品ID.Add(570);
                    幸运方块.配置.幸运方块掉落物品ID.Add(571);
                    幸运方块.配置.幸运方块掉落物品ID.Add(572);
                    幸运方块.配置.幸运方块掉落物品ID.Add(580);
                    幸运方块.配置.幸运方块掉落物品ID.Add(581);
                    幸运方块.配置.幸运方块掉落物品ID.Add(582);
                    幸运方块.配置.幸运方块掉落物品ID.Add(593);
                    幸运方块.配置.幸运方块掉落物品ID.Add(603);
                    幸运方块.配置.幸运方块掉落物品ID.Add(655);
                    幸运方块.配置.幸运方块掉落物品ID.Add(661);
                    幸运方块.配置.幸运方块掉落物品ID.Add(671);
                    幸运方块.配置.幸运方块掉落物品ID.Add(672);
                    幸运方块.配置.幸运方块掉落物品ID.Add(678);
                    幸运方块.配置.幸运方块掉落物品ID.Add(682);
                    幸运方块.配置.幸运方块掉落物品ID.Add(683);
                    幸运方块.配置.幸运方块掉落物品ID.Add(684);
                    幸运方块.配置.幸运方块掉落物品ID.Add(685);
                    幸运方块.配置.幸运方块掉落物品ID.Add(686);
                    幸运方块.配置.幸运方块掉落物品ID.Add(691);
                    幸运方块.配置.幸运方块掉落物品ID.Add(692);
                    幸运方块.配置.幸运方块掉落物品ID.Add(693);
                    幸运方块.配置.幸运方块掉落物品ID.Add(694);
                    幸运方块.配置.幸运方块掉落物品ID.Add(695);
                    幸运方块.配置.幸运方块掉落物品ID.Add(696);
                    幸运方块.配置.幸运方块掉落物品ID.Add(697);
                    幸运方块.配置.幸运方块掉落物品ID.Add(698);
                    幸运方块.配置.幸运方块掉落物品ID.Add(709);
                    幸运方块.配置.幸运方块掉落物品ID.Add(710);
                    幸运方块.配置.幸运方块掉落物品ID.Add(716);
                    幸运方块.配置.幸运方块掉落物品ID.Add(717);
                    幸运方块.配置.幸运方块掉落物品ID.Add(719);
                    幸运方块.配置.幸运方块掉落物品ID.Add(721);
                    幸运方块.配置.幸运方块掉落物品ID.Add(722);
                    幸运方块.配置.幸运方块掉落物品ID.Add(723);
                    幸运方块.配置.幸运方块掉落物品ID.Add(724);
                    幸运方块.配置.幸运方块掉落物品ID.Add(725);
                    幸运方块.配置.幸运方块掉落物品ID.Add(726);
                    幸运方块.配置.幸运方块掉落物品ID.Add(727);
                    幸运方块.配置.幸运方块掉落物品ID.Add(728);
                    幸运方块.配置.幸运方块掉落物品ID.Add(729);
                    幸运方块.配置.幸运方块掉落物品ID.Add(730);
                    幸运方块.配置.幸运方块掉落物品ID.Add(731);
                    幸运方块.配置.幸运方块掉落物品ID.Add(732);
                    幸运方块.配置.幸运方块掉落物品ID.Add(739);
                    幸运方块.配置.幸运方块掉落物品ID.Add(740);
                    幸运方块.配置.幸运方块掉落物品ID.Add(744);
                    幸运方块.配置.幸运方块掉落物品ID.Add(751);
                    幸运方块.配置.幸运方块掉落物品ID.Add(754);
                    幸运方块.配置.幸运方块掉落物品ID.Add(755);
                    幸运方块.配置.幸运方块掉落物品ID.Add(795);
                    幸运方块.配置.幸运方块掉落物品ID.Add(796);
                    幸运方块.配置.幸运方块掉落物品ID.Add(797);
                    幸运方块.配置.幸运方块掉落物品ID.Add(800);
                    幸运方块.配置.幸运方块掉落物品ID.Add(801);
                    幸运方块.配置.幸运方块掉落物品ID.Add(802);
                    幸运方块.配置.幸运方块掉落物品ID.Add(831);
                    幸运方块.配置.幸运方块掉落物品ID.Add(832);
                    幸运方块.配置.幸运方块掉落物品ID.Add(857);
                    幸运方块.配置.幸运方块掉落物品ID.Add(859);
                    幸运方块.配置.幸运方块掉落物品ID.Add(860);
                    幸运方块.配置.幸运方块掉落物品ID.Add(864);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(-55);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(-51);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(-45);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(-29);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(-25);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(-9);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(-8);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(-8);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(-4);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(1);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(2);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(3);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(6);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(10);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(16);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(17);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(18);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(19);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(20);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(21);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(22);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(23);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(25);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(28);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(29);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(32);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(38);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(42);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(43);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(44);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(45);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(48);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(51);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(52);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(59);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(61);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(70);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(72);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(76);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(77);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(79);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(82);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(85);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(104);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(109);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(120);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(140);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(141);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(149);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(153);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(156);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(160);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(168);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(185);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(195);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(207);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(208);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(211);
                    幸运方块.配置.幸运方块召唤怪物ID.Add(217);
                    幸运方块.配置.幸运方块生成弹幕ID.Add(28);
                    幸运方块.配置.幸运方块生成弹幕ID.Add(29);
                    幸运方块.配置.幸运方块生成弹幕ID.Add(43);
                    幸运方块.配置.幸运方块生成弹幕ID.Add(50);
                    幸运方块.配置.幸运方块生成弹幕ID.Add(516);
                    幸运方块.配置.幸运方块生成弹幕ID.Add(903);
                    幸运方块.配置.幸运方块生成弹幕ID.Add(904);
                    幸运方块.配置.幸运方块生成弹幕ID.Add(905);
                    幸运方块.配置.幸运方块生成弹幕ID.Add(906);
                    幸运方块.配置.幸运方块生成弹幕ID.Add(910);
                    幸运方块.配置.幸运方块生成弹幕ID.Add(911);
                    幸运方块.配置.幸运方块生成弹幕ID.Add(637);
                    幸运方块.配置.幸运方块给予BUFF.Add(1);
                    幸运方块.配置.幸运方块给予BUFF.Add(2);
                    幸运方块.配置.幸运方块给予BUFF.Add(3);
                    幸运方块.配置.幸运方块给予BUFF.Add(4);
                    幸运方块.配置.幸运方块给予BUFF.Add(5);
                    幸运方块.配置.幸运方块给予BUFF.Add(6);
                    幸运方块.配置.幸运方块给予BUFF.Add(7);
                    幸运方块.配置.幸运方块给予BUFF.Add(9);
                    幸运方块.配置.幸运方块给予BUFF.Add(10);
                    幸运方块.配置.幸运方块给予BUFF.Add(11);
                    幸运方块.配置.幸运方块给予BUFF.Add(20);
                    幸运方块.配置.幸运方块给予BUFF.Add(22);
                    幸运方块.配置.幸运方块给予BUFF.Add(24);
                    幸运方块.配置.幸运方块给予BUFF.Add(34);
                    幸运方块.配置.幸运方块给予BUFF.Add(63);
                    幸运方块.配置.幸运方块给予BUFF.Add(67);
                    幸运方块.配置.幸运方块给予BUFF.Add(70);
                    幸运方块.配置.幸运方块给予BUFF.Add(104);
                    幸运方块.配置.幸运方块给予BUFF.Add(105);
                    幸运方块.配置.幸运方块给予BUFF.Add(107); 
                    幸运方块.配置.幸运方块给予BUFF.Add(108);
                    幸运方块.配置.幸运方块给予BUFF.Add(110);
                    幸运方块.配置.幸运方块给予BUFF.Add(113);
                    幸运方块.配置.幸运方块给予BUFF.Add(116);
                    幸运方块.配置.幸运方块给予BUFF.Add(120);
                    幸运方块.配置.自定义事件_概率为100减物品概率减怪物概率减弹幕概率减给予BUFF概率.Add(new()
                    {
                        事件名 = "炸弹",
                        喊话_仅触发玩家可见 = "小心炸弹",
                        掉落物品 = { new 物品() { 物品ID = 166, 数量 = 1, 前缀 = 0 } },
                        召唤怪物 = { new 怪物() { 怪物ID = 38, X坐标 = 0, Y坐标 = -3 } },
                        给予BUFF = { new BUFF() {BUFF_ID = 32, 时长_秒 = 10 } },
                        生成弹幕 = { new 弹幕() { 弹幕ID = 470, X坐标 = 0, Y坐标 = -3, X速度 = 0, Y速度 = 0, 伤害 = 1000, 击退 = 0, 释放者是否是玩家 = false } }
                    });
                    幸运方块.配置.自定义事件_概率为100减物品概率减怪物概率减弹幕概率减给予BUFF概率.Add(new()
                    {
                        事件名 = "死亡",
                        喊话_全体玩家可见 = "{0}开出了不好的东西",
                        使用指令 = new() { "/kill {0}","/respawn" }
                    });

                    File.WriteAllText(path, JsonConvert.SerializeObject(幸运方块.配置, Formatting.Indented));
                }
            }
            catch
            {
                TSPlayer.Server.SendErrorMessage($"[幸运方块]配置文件读取错误！！！");
            }
        }
        public bool 是否启用幸运方块 = true;
        public bool 是否广播幸运方块开出的事件 = true;
        public List<int> 幸运方块内部图格ID = new() { };
        public int 幸运方块掉落物品概率_百分率 = 40;
        public int 幸运方块掉落物品最大数量 = 4;
        public int 幸运方块掉落物品最小数量 = 1;
        public List<int> 幸运方块掉落物品ID = new() { };
        public int 幸运方块召唤怪物概率_百分率 = 10;
        public int 幸运方块召唤怪物最大数量 = 1;
        public int 幸运方块召唤怪物最小数量 = 1;
        public List<int> 幸运方块召唤怪物ID = new() { };
        public int 幸运方块生成弹幕概率_百分率 = 20;
        public int 幸运方块生成弹幕最大数量 = 2;
        public int 幸运方块生成弹幕最小数量 = 1;
        public List<int> 幸运方块生成弹幕ID = new() { };
        public int 幸运方块给予BUFF概率_百分率 = 5;
        public int 幸运方块给予BUFF最大数量 = 1;
        public int 幸运方块给予BUFF最小数量 = 1;
        public int 幸运方块给予BUFF最长时长_秒 = 120;
        public int 幸运方块给予BUFF最短时长_秒 = 20;
        public List<int> 幸运方块给予BUFF= new() { };
        public List<自定义事件> 自定义事件_概率为100减物品概率减怪物概率减弹幕概率减给予BUFF概率 = new () { };
        public static string path = "tshock/幸运方块配置表.json";
        public class 自定义事件
        {
            public string 事件名 = "";
            public string 喊话_仅触发玩家可见 = "";
            public string 喊话_全体玩家可见 = "";
            public List<物品> 掉落物品 = new() { };
            public List<怪物> 召唤怪物 = new() { };
            public List<弹幕> 生成弹幕 = new() { };
            public List<BUFF> 给予BUFF = new() { };
            public List<string> 使用指令 = new() { };
        }
        public class 物品
        {
            public int 物品ID = 0;
            public int 数量 = 0;
            public int 前缀 = 0;
        }
        public class 怪物
        {
            public int 怪物ID = 0;
            public int X坐标 = 0;
            public int Y坐标 = 0;
        }
        public class 弹幕
        {
            public int 弹幕ID = 0;
            public int X坐标 = 0;
            public int Y坐标 = 0;
            public int X速度 = 0;
            public int Y速度 = 0;
            public int 伤害 = 0;
            public int 击退 = 0;
            public bool 释放者是否是玩家 = false;
        }
        public class BUFF
        {
            public int BUFF_ID = 0;
            public int 时长_秒 = 0;
        }
    }
}

